{"title":"Middle-earth & J.R.R. Tolkien Blog","url":"https://middle-earth.xenite.org","favicon":"https://middle-earth.xenite.org/favicon.ico","elements":[{"title":"Did Any Orcs and Trolls Fight against Sauron in the War of the last Alliance?","contents":"Q: Did Any Orcs and Trolls Fight against Sauron in the War of the last Alliance? ANSWER: I have rephrased a question I received in […]","link":"https://middle-earth.xenite.org/did-any-orcs-and-trolls-fight-against-sauron-in-the-war-of-the-last-alliance/","retrieved":1695317749078},{"title":"What Was the Significance of Height in Tolkien’s Stories?","contents":"Q: What Was the Significance of Height in Tolkien’s Stories? ANSWER: A long-time blog reader submitted the following question in December 2020: In Tolkiens writings […]","link":"https://middle-earth.xenite.org/what-was-the-significance-of-height-in-tolkiens-stories/","retrieved":1695231350434},{"title":"Did Faded Elvish Spirits Make Their Ways to Valinor?","contents":"Q: Did Faded Elvish Spirits Make Their Ways to Valinor? ANSWER: In December 2020 a reader submitted the following question about faded Elvish spirits: I […]","link":"https://middle-earth.xenite.org/did-faded-elvish-spirits-make-their-ways-to-valinor/","retrieved":1695231350441},{"title":"Were the Men of Lake-town Related to the Gondorians?","contents":"Q: Were the Men of Lake-town Related to the Gondorians? ANSWER: The Men of Lake-town were closely related to the Men of Dale and the […]","link":"https://middle-earth.xenite.org/were-the-men-of-lake-town-related-to-the-gondorians/","retrieved":1695231350442},{"title":"Why Couldn’t Anduril Have Hurt Gandalf As Narsil Had Harmed Sauron?","contents":"Q: Why Couldn’t Anduril Have Hurt Gandalf As Narsil Had Harmed Sauron? ANSWER: I received the following question in January 2023: When Gandalf meets Aragorn, […]","link":"https://middle-earth.xenite.org/why-couldnt-anduril-have-hurt-gandalf-as-narsil-had-harmed-sauron/","retrieved":1695231350445},{"title":"Is Dorwinion A Part of Rhûn?","contents":"Q: Is Dorwinion A Part of Rhûn? ANSWER: Short answer: no, Dorwinion is not “a part of Rhûn”. I received the following question in March […]","link":"https://middle-earth.xenite.org/is-dorwinion-a-part-of-rhun/","retrieved":1695231350447},{"title":"How Well Did Tolkien Imagine Longevity?","contents":"Q: How Well Did Tolkien Imagine Longevity? ANSWER: I received this stream of questions from a reader in June 2021: I would really love to […]","link":"https://middle-earth.xenite.org/how-well-did-tolkien-imagine-longevity/","retrieved":1695231350449},{"title":"What Allegations Did Michael Martinez Make Against Tolkien In His Biography?","contents":"Q: What Allegations Did Michael Martinez Make Against Tolkien In His Biography? ANSWER: This is a real question, though not submitted directly to me. Apparently […]","link":"https://middle-earth.xenite.org/what-allegations-did-michael-martinez-make-against-tolkien-in-his-biography/","retrieved":1695231350452},{"title":"Did Tolkien Ever Use the Phrase ‘Mythology for England’?","contents":"Q: Did Tolkien Ever Use the Phrase ‘Mythology for England’? ANSWER: This question is an amalgam of questions people ask almost continually. The issue of […]","link":"https://middle-earth.xenite.org/did-tolkien-ever-use-the-phrase-mythology-for-england/","retrieved":1695231350454},{"title":"Could The One Ring Have Influenced Bill Ferny in Bree?","contents":"Q: Could The One Ring Have Influenced Bill Ferny in Bree? ANSWER: A reader submitted this question in April 2021: Could the One Ring have […]","link":"https://middle-earth.xenite.org/could-the-one-ring-have-influenced-bill-ferny-in-bree/","retrieved":1695231350456},{"title":"Why Did Bombadil Tolerate the Presence of Barrow-wights?","contents":"Q: Why Did Bombadil Tolerate the Presence of Barrow-wights? ANSWER: A reader submitted this question in March 2021: Tom Bombadil considered the Barrow Downs, or […]","link":"https://middle-earth.xenite.org/why-did-bombadil-tolerate-the-presence-of-barrow-wights/","retrieved":1695231350458},{"title":"When Did Hobbits become Divided into Fallohides, Stoors, and Harfoots?","contents":"Q: When Did Hobbits become Divided into Fallohides, Stoors, and Harfoots? ANSWER: This is an amalgam of questions I’ve been receiving going back to at […]","link":"https://middle-earth.xenite.org/when-did-hobbits-become-divided-into-fallohides-stoors-and-harfoots/","retrieved":1695231350460},{"title":"Was Galadriel A Warrior?","contents":"Q: Was Galadriel A Warrior? ANSWER: Yes. Galadriel was a warrior (in J.R.R. Tolkien’s mind). She was Sauron’s enemy. She opposed him for thousands of […]","link":"https://middle-earth.xenite.org/was-galadriel-a-warrior/","retrieved":1695231350462},{"title":"Why Did the Balrog Fall If It Had Wings?","contents":"Q: Why Did the Balrog Fall If It Had Wings? ANSWER: Like dead and dying dragons, dead and dying balrogs don’t fly. However, this is […]","link":"https://middle-earth.xenite.org/why-did-the-balrog-fall-if-it-had-wings/","retrieved":1695231350470},{"title":"How Could the Hobbits Have Known about the Thinking Fox in the Shire?","contents":"Q: How Could the Hobbits Have Known about the Thinking Fox in the Shire? ANSWER: I received the following question from a reader in February […]","link":"https://middle-earth.xenite.org/how-could-the-hobbits-have-known-about-the-thinking-fox-in-the-shire/","retrieved":1695231350473},{"title":"Were the Rohirrim the Southernmost Group of Northmen?","contents":"Q: Were the Rohirrim the Southernmost Group of Northmen? ANSWER: I received this question in December of 2020. I apologize for waiting so long to […]","link":"https://middle-earth.xenite.org/were-the-rohirrim-the-southernmost-group-of-northmen/","retrieved":1695231350474}]}