{"title":"Middle-earth & J.R.R. Tolkien Blog","url":"https://middle-earth.xenite.org","favicon":"https://middle-earth.xenite.org/favicon.ico","elements":[{"title":"Short Questions and Answers Vol. 8","contents":"I’ve been sitting on some questions and comments submitted by readers in 2020. They don’t fall into the normal category of questions, so in order […]","retrieved":1627561858000},{"title":"Did Tolkien Explain Seasons before the Changing of the World?","contents":"Q: Did Tolkien Explain Seasons before the Changing of the World? ANSWER: A reader sent in the following interesting question in July 2020: Did Tolkien […]","retrieved":1627302605000},{"title":"What Did Gandalf Do before He Met Bilbo Baggins?","contents":"Q: What Did Gandalf Do before He Met Bilbo Baggins? ANSWER: According to the Tale of Years in the LoTR Appendices, Gandalf lived in Middle-earth […]","retrieved":1626093004000},{"title":"What Were the Other Evils Gandalf Mentioned?","contents":"Q: What Were the Other Evils Gandalf Mentioned? ANSWER: A reader submitted this question: What could the “other evils” be that Gandalf warned could come […]","retrieved":1625747440000},{"title":"Could Weakened Ainur Regain Their Former Strength?","contents":"Q: Could Weakened Ainur Regain Their Former Strength? ANSWER: Received the following comment and question: I’ve always been fascinated by the concept of Ainur such […]","retrieved":1625488221000},{"title":"Could Tolkien Dwarves Swim?","contents":"Could Tolkien Dwarves Swim? ANSWER: Yes. Well, in the sense that it wasn’t physically impossible for them to, that’s the short answer. Convincing people that […]","retrieved":1614000658000},{"title":"Could Aragorn and Boromir have Helped Gandalf against the Balrog?","contents":"Q: Could Aragorn and Boromir have Helped Gandalf against the Balrog? ANSWER: This is one of those questions that invites speculation. While I don’t recall […]","retrieved":1613655003000},{"title":"What Does It Mean to Cast Up A Sword?","contents":"Q: What Does It Mean to Cast Up A Sword? ANSWER: Tolkien often used obscure meanings for common, everyday English words. Deciphering what he meant […]","retrieved":1613395838000},{"title":"Amazon Releases 1st Official Summary for Lord of the Rings TV Show","contents":"Per TheOneRing.Net: Amazon Studios’ forthcoming series brings to screens for the very first time the heroic legends of the fabled Second Age of Middle-earth’s history. […]","retrieved":1610509871000},{"title":"Why Did Aragorn Forget Thranduil’s Name in the “Two Towers” Movie?","contents":"Q: Why Did Aragorn Forget Thranduil’s Name in the “Two Towers” Movie? ANSWER: A fan-made video uploaded to YouTube has been circulating for years, claiming […]","retrieved":1608557434000},{"title":"Why Didn’t Sauron Know that Aragorn Existed?","contents":"Q: Why Didn’t Sauron Know that Aragorn Existed? ANSWER: I received the following question in July 2020: Could Sauron have discovered from Saruman that Isildur’s […]","retrieved":1607607030000},{"title":"Random Questions from a Single Reader","contents":"Q: Random Questions from a Single Reader ANSWER: Normally when people submit multiple questions I try to space out the answers for them across multiple […]","retrieved":1607347830000}]}