{"title":"Middle-earth & J.R.R. Tolkien Blog","url":"https://middle-earth.xenite.org","favicon":"https://middle-earth.xenite.org/favicon.ico","elements":[{"title":"Did J.R.R. Tolkien Think The Lord of The Rings Was “English”?","contents":"Q: Did J.R.R. Tolkien Think The Lord of The Rings was “English”? ANSWER: The Book of Lost Tales was J.R.R. Tolkien’s self-styled “mythology for England”, […]","link":"https://middle-earth.xenite.org/did-j-r-r-tolkien-think-the-lord-of-the-rings-was-english/","retrieved":1639676749092},{"title":"Could the Dwarves of Ered Luin Have Reclaimed Belegost?","contents":"Q: Could the Dwarves of Ered Luin Have Reclaimed Belegost? ANSWER: I received the following question from a blog reader in March 2020. Spending some […]","link":"https://middle-earth.xenite.org/could-the-dwarves-of-ered-luin-have-reclaimed-belegost/","retrieved":1639417488767},{"title":"What Was the Course of Ar-Pharazôn’s Last Campaign Against Sauron?","contents":"Q: What Was the Course of Ar-Pharazôn’s Last Campaign Against Sauron? ANSWER: This question has nothing to do with the Amazon production. A blog reader […]","link":"https://middle-earth.xenite.org/what-was-the-course-of-ar-pharazons-last-campaign-against-sauron/","retrieved":1639072082961},{"title":"What Is Possible within the Confines of Tolkien’s World?","contents":"Q: What Is Possible within the Confines of Tolkien’s World? One of the most unusual science fiction books I’ve ever read was King David’s Spaceship […]","link":"https://middle-earth.xenite.org/what-is-possible-within-the-confines-of-tolkiens-world/","retrieved":1638812243185},{"title":"Short Questions and Answers Vol. 8","contents":"Comments on Weathertop In 2013 I wrote How High Was Weathertop? In May 2020 I received the following commentary on the article. I’ve put off […]","link":"https://middle-earth.xenite.org/short-questions-and-answers-vol-8/","retrieved":1638035001060},{"title":"Did Tolkien Explain Seasons before the Changing of the World?","contents":"Q: Did Tolkien Explain Seasons before the Changing of the World? ANSWER: A reader sent in the following interesting question in July 2020: Did Tolkien […]","link":"https://middle-earth.xenite.org/did-tolkien-explain-seasons-before-the-changing-of-the-world/","retrieved":1638035001062},{"title":"What Did Gandalf Do before He Met Bilbo Baggins?","contents":"Q: What Did Gandalf Do before He Met Bilbo Baggins? ANSWER: According to the Tale of Years in the LoTR Appendices, Gandalf lived in Middle-earth […]","link":"https://middle-earth.xenite.org/what-did-gandalf-do-before-he-met-bilbo-baggins/","retrieved":1638035001063},{"title":"What Were the Other Evils Gandalf Mentioned?","contents":"Q: What Were the Other Evils Gandalf Mentioned? ANSWER: A reader submitted this question: What could the “other evils” be that Gandalf warned could come […]","link":"https://middle-earth.xenite.org/what-were-the-other-evils-gandalf-mentioned/","retrieved":1638035001065},{"title":"Could Weakened Ainur Regain Their Former Strength?","contents":"Q: Could Weakened Ainur Regain Their Former Strength? ANSWER: Received the following comment and question: I’ve always been fascinated by the concept of Ainur such […]","link":"https://middle-earth.xenite.org/could-weakened-ainur-regain-their-former-strength/","retrieved":1638035001067},{"title":"Could Tolkien Dwarves Swim?","contents":"Could Tolkien Dwarves Swim? ANSWER: Yes. Well, in the sense that it wasn’t physically impossible for them to, that’s the short answer. Convincing people that […]","link":"https://middle-earth.xenite.org/could-tolkien-dwarves-swim/","retrieved":1638035001067},{"title":"Could Aragorn and Boromir have Helped Gandalf against the Balrog?","contents":"Q: Could Aragorn and Boromir have Helped Gandalf against the Balrog? ANSWER: This is one of those questions that invites speculation. While I don’t recall […]","link":"https://middle-earth.xenite.org/could-aragorn-and-boromir-have-helped-gandalf-against-the-balrog/","retrieved":1638035001068},{"title":"What Does It Mean to Cast Up A Sword?","contents":"Q: What Does It Mean to Cast Up A Sword? ANSWER: Tolkien often used obscure meanings for common, everyday English words. Deciphering what he meant […]","link":"https://middle-earth.xenite.org/what-does-it-mean-to-cast-up-a-sword/","retrieved":1638035001069}]}