{"title":"Middle-earth & J.R.R. Tolkien Blog","url":"https://middle-earth.xenite.org","favicon":"https://middle-earth.xenite.org/favicon.ico","elements":[{"title":"Short Questions and Answers Vol. 8","contents":"Comments on Weathertop In 2013 I wrote How High Was Weathertop? In May 2020 I received the following commentary on the article. I’ve put off […]","link":"https://middle-earth.xenite.org/short-questions-and-answers-vol-8/","retrieved":1638035001060},{"title":"Did Tolkien Explain Seasons before the Changing of the World?","contents":"Q: Did Tolkien Explain Seasons before the Changing of the World? ANSWER: A reader sent in the following interesting question in July 2020: Did Tolkien […]","link":"https://middle-earth.xenite.org/did-tolkien-explain-seasons-before-the-changing-of-the-world/","retrieved":1638035001062},{"title":"What Did Gandalf Do before He Met Bilbo Baggins?","contents":"Q: What Did Gandalf Do before He Met Bilbo Baggins? ANSWER: According to the Tale of Years in the LoTR Appendices, Gandalf lived in Middle-earth […]","link":"https://middle-earth.xenite.org/what-did-gandalf-do-before-he-met-bilbo-baggins/","retrieved":1638035001063},{"title":"What Were the Other Evils Gandalf Mentioned?","contents":"Q: What Were the Other Evils Gandalf Mentioned? ANSWER: A reader submitted this question: What could the “other evils” be that Gandalf warned could come […]","link":"https://middle-earth.xenite.org/what-were-the-other-evils-gandalf-mentioned/","retrieved":1638035001065},{"title":"Could Weakened Ainur Regain Their Former Strength?","contents":"Q: Could Weakened Ainur Regain Their Former Strength? ANSWER: Received the following comment and question: I’ve always been fascinated by the concept of Ainur such […]","link":"https://middle-earth.xenite.org/could-weakened-ainur-regain-their-former-strength/","retrieved":1638035001067},{"title":"Could Tolkien Dwarves Swim?","contents":"Could Tolkien Dwarves Swim? ANSWER: Yes. Well, in the sense that it wasn’t physically impossible for them to, that’s the short answer. Convincing people that […]","link":"https://middle-earth.xenite.org/could-tolkien-dwarves-swim/","retrieved":1638035001067},{"title":"Could Aragorn and Boromir have Helped Gandalf against the Balrog?","contents":"Q: Could Aragorn and Boromir have Helped Gandalf against the Balrog? ANSWER: This is one of those questions that invites speculation. While I don’t recall […]","link":"https://middle-earth.xenite.org/could-aragorn-and-boromir-have-helped-gandalf-against-the-balrog/","retrieved":1638035001068},{"title":"What Does It Mean to Cast Up A Sword?","contents":"Q: What Does It Mean to Cast Up A Sword? ANSWER: Tolkien often used obscure meanings for common, everyday English words. Deciphering what he meant […]","link":"https://middle-earth.xenite.org/what-does-it-mean-to-cast-up-a-sword/","retrieved":1638035001069},{"title":"Amazon Releases 1st Official Summary for Lord of the Rings TV Show","contents":"Per TheOneRing.Net: Amazon Studios’ forthcoming series brings to screens for the very first time the heroic legends of the fabled Second Age of Middle-earth’s history. […]","link":"https://middle-earth.xenite.org/amazon-releases-1st-official-summary-for-lord-of-the-rings-tv-show/","retrieved":1638035001074},{"title":"Why Did Aragorn Forget Thranduil’s Name in the “Two Towers” Movie?","contents":"Q: Why Did Aragorn Forget Thranduil’s Name in the “Two Towers” Movie? ANSWER: A fan-made video uploaded to YouTube has been circulating for years, claiming […]","link":"https://middle-earth.xenite.org/why-did-aragorn-forget-thranduils-name-in-the-two-towers-movie/","retrieved":1638035001075},{"title":"Why Didn’t Sauron Know that Aragorn Existed?","contents":"Q: Why Didn’t Sauron Know that Aragorn Existed? ANSWER: I received the following question in July 2020: Could Sauron have discovered from Saruman that Isildur’s […]","link":"https://middle-earth.xenite.org/why-didnt-sauron-know-that-aragorn-existed/","retrieved":1638035001076},{"title":"Random Questions from a Single Reader","contents":"Q: Random Questions from a Single Reader ANSWER: Normally when people submit multiple questions I try to space out the answers for them across multiple […]","link":"https://middle-earth.xenite.org/random-questions-from-a-single-reader/","retrieved":1638035001077}]}